app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments"
---
  def index
      @appointments = Appointment.all(:conditions => ["id IN (?) OR author_id = ?", @memberships.map{|m| m.appointment_id}, current_user.id])

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "shares".* FROM "shares" WHERE "shares"."appointment_id" = 2 AND "shares"."user_id" = 1
---
  def show
    @appointment = Appointment.find(params[:id])
    @memberships.each do |m|
	if [ m.appointment_id == @appointment.id || @appointment.author_id == current_user.id ]
	    @access = true
	    @creator = User.find(@appointment.author_id)
	    @shares = Shares.find(:all, :conditions => { :appointment_id => @appointment.id })

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @appointment = Appointment.find(params[:id])

INSERT INTO "appointments" ("author_id", "created_at", "description", "name", "participants", "time", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "appointments" SET "author_id" = 1, "updated_at" = '2012-12-03 14:13:21.452680' WHERE "appointments"."id" = 1
---
  def create
    @appointment = Appointment.create(params[:appointment])
    @appointment.author_id = current_user.id
    Member.create(:user_id => current_user.id, :appointment_id => @appointment.id)

    respond_to do |format|
      if @appointment.save

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "appointments" SET "name" = 'Piratess', "updated_at" = '2012-12-04 16:16:24.410460' WHERE "appointments"."id" = 5
---
  def update
    @appointment = Appointment.find(params[:id])

    respond_to do |format|
      if @appointment.update_attributes(params[:appointment])

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 2]]
---
  def destroy
    @appointment = Appointment.find(params[:id])
    @appointment.destroy