app/controllers/home_controller.rb

  def index
    if Appointment.count != 0 && defined?(@memberships)
      @latest_appointment = Appointment.last(:conditions => ["id IN (?) OR author_id = ?", @memberships.map{|m| m.appointment_id}, current_user.id])
---
SELECT "appointments".* FROM "appointments" ORDER BY "appointments"."id" DESC LIMIT 1