app/controllers/shares_controller.rb

INSERT INTO "shares" ("appointment_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["appointment_id", nil], ["created_at", Mon, 03 Dec 2012 15:27:10 UTC +00:00], ["updated_at", Mon, 03 Dec 2012 15:27:10 UTC +00:00], ["user_id", nil]]
---
  def create
    @share = Shares.new
    @share = Shares.create(params[:share])

SELECT "shares".* FROM "shares" WHERE (appointment_id = '6' AND user_id = 2) LIMIT 1
DELETE FROM "shares" WHERE "shares"."id" = ?  [["id", 19]]
---
  def destroy
    @share = Shares.first(:conditions => [ 'appointment_id = ? AND user_id = ?',  params[:id], current_user.id ] )
    @share.destroy