app/views/appointments/show.html.erb

SELECT "users".* FROM "users" WHERE (id IN (3,2))
---
			<%= form_for([@appointment, @new_member]) do |f| %>
				<%= f.select 'user_id', options_for_select(@users.collect{ |u| [u.username, u.id] }) %> <%= f.submit "Add" %>